# 1.Напишите программу, которая принимает на вход
# число N и выдает последовательность из N членов.
# def n_func():
#     for i in range(int(input("Input your number: "))):
#         print((-3) ** i, end = ' ')
# n_func()       

# 2.Создать список, длины n, значения формируются
# по формуле 3k + 1, где k принимает значения от 1 
# до n включительно.
# n = []
# a = int(input())
# for k in range (1, a + 1):
#     n.append(k * 3 + 1)
# print (n)    

## print dir(list)

# 3.Напишите программу, в которой пользователь будет 
# задавать две строки, программа - определять количество
# вхождений одной строки в другой.
print(0)
