# 1. Напишите программу, которая принимает на вход
# два числа и проверяет, яв-ся ли одно число квадратом другого

# n = int(input())
# m = int(input())

# if n == m ** 2 or m == n ** 2:
#  print("Yes")
# else:
#  print("No")

# 2.Напишите программу которая на вход принимает
# 5  чисел и находит максимальное число из них.
# num_max = 0
# for i in range (5): 
#    num = int(input())
#    if num_max < num:
#        num_max = num
# print(num_max)

# 3. Напишите программу, которая будет на вход принмать
# число N и выводить числа от -N до N.
# n = int(input())
# print (*range (-n, n +1))

# 4.Напишите программу,которая будет принимать на вход дробь и показывать
# первую цифру дробной части числа
# n = float(input())
# new_num = int(n * 10 % 10)
# print(new_num)

# 5.Напишите программу, которая принимает на вход и
# проверяет, кратно ли оно 5 и 10 или 15,но не 30

# n = int(input())
# num = n * 10
# if (num % 5 == 0 and num % 10 == 0 or num % 15 == 0) and num % 30 != 0:
#    print("yes")
# else: 
#    print("no")
a = 3
b = 5
print(a+b)


   

